import AccordionList from "@/components/ui/accordation";
import Image from "next/image";
const faqItems = [
  {
    question: "قوانین عمومی",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
  {
    question: "قوانین رزرو",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
  {
    question: "قوانین اقامت",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
  {
    question: "قوانین استفاده از امکانات هتل",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
  {
    question: "مسائل مالی",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
];

function RulesPart() {
  return (
    <div className="max-w-[1440px] mx-auto px-6 py-12">
      <div className="w-full flex flex-col gap-14">
        <div className="flex items-center gap-3">
          <Image
            src="/image24.png"
            alt="rulesHead"
            height={40}
            width={40}
            className="mb-1"
          />
          <h1 className="text-xl font-semibold">
            شرایط و قوانین استفاده از سرویس‌ها و خدمات هتل ساحلی موجان
          </h1>
        </div>

        <div className="flex flex-col gap-4 leading-8">
          <p>
            کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و
            برنامه‌‏های کاربردی موجان به دقت ملاحظه فرمایید.
          </p>

          <p>
            ورود کاربران به وب‏‌سایت موجان هنگام استفاده از پروفایل شخصی،
            طرح‏‌های تشویقی، ویدئوهای رسانه تصویری موجان و سایر خدمات ارائه شده
            توسط موجان به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه
            استفاده از سرویس‌‏ها و خدمات موجان است. توجه داشته باشید که ثبت
            سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین موجان
            از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه
            توافق‏‌های قبلی محسوب می‏‌شود.
          </p>
        </div>

        <div>
          <AccordionList items={faqItems} />
        </div>
      </div>
    </div>
  );
}

export default RulesPart;
